src/main/webapp/WEB-INF/classes/com/report/.svn/text-base/soaprequest.xml.svn-base

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://oracle.com/determinations/server/12.2.1/rulebase/assess/types"><SOAP-ENV:Header><o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><o:UsernameToken><o:Username>apiuser</o:Username><o:Password>ApiUser@123</o:Password></o:UsernameToken></o:Security></SOAP-ENV:Header><SOAP-ENV:Body><typ:assess-request><typ:config><typ:outcome><typ:entity id="global"><typ:attribute-outcome id="MF_no" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="MF_rate" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="PMS_no" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="PMS_rate" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="BTL_initiatives_no" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="BTL_initiatives_rate" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="account_opened_via_LMS_no" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="account_opened_via_LMS_rate" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="total_incentive_kitty_amount" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="incentive_for_lead_conversion" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="performance_incentive" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="the_Final_Additional_Incentive" known-outcome-style="value-only" unknown-outcome-style="value-only"/></typ:entity><typ:entity id="the_employee"><typ:attribute-outcome id="employee_name" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="employee_ID" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="employee_actual_basic_pay" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="first_90_days_brokerage_amount" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_processed_average_basic_pay" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_designation" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="additional_incentive" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_basic_proportion" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_flat_incentive_Monthly" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_Quarterly_Performance_rating_by_HOD" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_performance_proportion" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_performance_incentive_Quarterly" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_additional_incentive_for_quality_conversion_Quarterly" known-outcome-style="value-only" unknown-outcome-style="value-only"/><typ:attribute-outcome id="Employee_total_payable" known-outcome-style="value-only" unknown-outcome-style="value-only"/></typ:entity></typ:outcome></typ:config><typ:global-instance><typ:attribute id="MF_no"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="MF_rate"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="PMS_no"><typ:number-val>2500000</typ:number-val></typ:attribute><typ:attribute id="PMS_rate"><typ:number-val>0.01</typ:number-val></typ:attribute><typ:attribute id="BTL_initiatives_no"><typ:number-val>378</typ:number-val></typ:attribute><typ:attribute id="BTL_initiatives_rate"><typ:number-val>365</typ:number-val></typ:attribute><typ:attribute id="account_opened_via_LMS_no"><typ:number-val>333</typ:number-val></typ:attribute><typ:attribute id="account_opened_via_LMS_rate"><typ:number-val>300</typ:number-val></typ:attribute><typ:entity id="the_employee"><typ:instance id="1"><typ:attribute id="employee_name"><typ:text-val>EMP 1</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>1</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>11700</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>31280</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>11700</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>MANAGER</typ:text-val></typ:attribute></typ:instance><typ:instance id="2"><typ:attribute id="employee_name"><typ:text-val>EMP 2</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>2</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>15219</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>22606</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>15219</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>SENIOR MANAGER</typ:text-val></typ:attribute></typ:instance><typ:instance id="3"><typ:attribute id="employee_name"><typ:text-val>EMP 3</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>3</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>6435</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>19116</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>6435</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>EXECUTIVE</typ:text-val></typ:attribute></typ:instance><typ:instance id="4"><typ:attribute id="employee_name"><typ:text-val>EMP 4</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>4</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>6125</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>11235</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>5787</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>EXECUTIVE</typ:text-val></typ:attribute></typ:instance><typ:instance id="5"><typ:attribute id="employee_name"><typ:text-val>EMP 5</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>5</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>11700</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>10134</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>11700</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>MANAGER</typ:text-val></typ:attribute></typ:instance><typ:instance id="6"><typ:attribute id="employee_name"><typ:text-val>EMP 6</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>6</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>15093</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>8660</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>15093</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>SENIOR MANAGER</typ:text-val></typ:attribute></typ:instance><typ:instance id="7"><typ:attribute id="employee_name"><typ:text-val>EMP 7</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>7</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>7020</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>3518</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>6869</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>SENIOR EXECUTIVE</typ:text-val></typ:attribute></typ:instance><typ:instance id="8"><typ:attribute id="employee_name"><typ:text-val>EMP 8</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>8</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>11700</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>3900</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>MANAGER</typ:text-val></typ:attribute></typ:instance><typ:instance id="9"><typ:attribute id="employee_name"><typ:text-val>EMP 9</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>9</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>14742</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>14496</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>SENIOR MANAGER</typ:text-val></typ:attribute></typ:instance><typ:instance id="10"><typ:attribute id="employee_name"><typ:text-val>EMP 10</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>10</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>4680</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>JUNIOR EXECUTIVE TRAINEE</typ:text-val></typ:attribute></typ:instance><typ:instance id="11"><typ:attribute id="employee_name"><typ:text-val>EMP 11</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>11</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>7020</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>SENIOR EXECUTIVE</typ:text-val></typ:attribute></typ:instance><typ:instance id="12"><typ:attribute id="employee_name"><typ:text-val>EMP 12</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>12</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>20000</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>19341</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>GM</typ:text-val></typ:attribute></typ:instance><typ:instance id="13"><typ:attribute id="employee_name"><typ:text-val>EMP 13</typ:text-val></typ:attribute><typ:attribute id="employee_ID"><typ:number-val>13</typ:number-val></typ:attribute><typ:attribute id="employee_actual_basic_pay"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="first_90_days_brokerage_amount"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_processed_average_basic_pay"><typ:number-val>0</typ:number-val></typ:attribute><typ:attribute id="Employee_designation"><typ:text-val>VICE PRESIDENT(HOD)</typ:text-val></typ:attribute></typ:instance></typ:entity></typ:global-instance></typ:assess-request></SOAP-ENV:Body></SOAP-ENV:Envelope>